import streamlit as st
import pandas as pd
import numpy as np


st.subheader('🧭南宁美食图')
st.map( pd.DataFrame({
                'latitude':[22.853986,22.826429,22.843103,22.772474,22.754556],
                'longitude':[108.222308,108.289355,108.267250,108.267086,108.266534]
}))

st.header("🍉用餐高峰时段")
# 定义数据,以便创建数据框
data = {
    '时段':[11, 12, 13],
    '炒面':[10, 20, 9],
    '凉面':[11, 16, 12],
    '猪脚饭':[11, 10, 16],
    '小耳朵自助':[13,14,18],
    '麦当劳':[14,19,17]
}
# 根据上面创建的data，创建数据框
df = pd.DataFrame(data)
# 定义数据框所用的新索引
index = pd.Series([1, 2, 3,], name='序号')
# 将新索引应用到数据框上
df.index = index
st.area_chart(df, x='时段')


# 定义数据,以便创建数据框
data = {
    '美食':['炒面', '凉面', '猪脚饭','小耳朵自助','麦当劳'],
    '评分':[6,7,5,10,8],

}
# 根据上面创建的data，创建数据框
df = pd.DataFrame(data)
# 定义数据框所用的新索引
index = pd.Series([1, 2, 3,4,5], name='序号')
# 将新索引应用到数据框上
df.index = index

st.header("🍟美食评分")
st.bar_chart(df, x='美食')
st.header("🍚不同食物类型价格")
# 定义数据,以便创建数据框
data = {
   '月份':['01月', '02月', '03月','04月','05月','06月','07月','08月','09月','10月','11月','12月'],
    '炒面':[20, 15, 18,12,13,14,15,17,12,13,11,12],
    '凉面':[12, 16, 12,12,12,13,14,15,16,12,11,12],
    '猪脚饭':[11, 10, 16,13,13,13,12,11,13,14,15,15],
    '麦当劳':[38,39,60,68,92,75,24,75,93,54,12,57],
    '小耳朵自助':[12,43,65,126,242,72,78,12,56,23,89,65]
}
# 根据上面创建的data，创建数据框
df = pd.DataFrame(data)
# 定义数据框所用的新索引
index = pd.Series([1, 2, 3,4,5,6,7,8,9,10,11,12], name='月份')
# 将新索引应用到数据框上
df.index = index
st.line_chart(df, x='月份')







